sandbox/src/cfg_buh/Documents/ПродажаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПродажаТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

sandbox/src/cfg_buh/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

sandbox/src/cfg_buh/Documents/ПродажаТовара/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;

	Для Каждого Стр Из Товары Цикл

		Если Не ЗначениеЗаполнено(Стр.Товар) Или Стр.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		// Списание со склада
		ДвОстатки = Движения.ОстаткиТоваров.Добавить();
		ДвОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвОстатки.Период = Дата;
		ДвОстатки.Товар = Стр.Товар;
		ДвОстатки.Количество = Стр.Количество;

		// Оборот продажи: выручка и себестоимость
		ДвПродажи = Движения.Продажи.Добавить();
		ДвПродажи.Период = Дата;
		ДвПродажи.Товар = Стр.Товар;
		ДвПродажи.Количество = Стр.Количество;
		ДвПродажи.Сумма = Стр.Сумма;
		ДвПродажи.Себестоимость = Стр.Товар.ЦенаЗакупки * Стр.Количество;

		// Бухгалтерская проводка: Дт 62 (Расчеты с покупателями) Кт 90.01 (Выручка)
		ДвБух = Движения.Хозрасчетный.Добавить();
		ДвБух.Период = Дата;
		ДвБух.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
		ДвБух.СчетКт = ПланыСчетов.Хозрасчетный.Выручка;
		ДвБух.СуммаДт = Стр.Сумма;
		ДвБух.СуммаКт = Стр.Сумма;

		// Себестоимость: Дт 90.02 (Себестоимость продаж) Кт 41 (Товары)
		ДвБух2 = Движения.Хозрасчетный.Добавить();
		ДвБух2.Период = Дата;
		ДвБух2.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьПродаж;
		ДвБух2.СчетКт = ПланыСчетов.Хозрасчетный.Товары;
		ДвБух2.СуммаДт = Стр.Товар.ЦенаЗакупки * Стр.Количество;
		ДвБух2.СуммаКт = Стр.Товар.ЦенаЗакупки * Стр.Количество;

	КонецЦикла;

КонецПроцедуры
